src/data_analysis/collected_data/orange/api/standarda2v2/e/load_compose.txt
Running 30m test @ http://20.108.188.2:60/wrk2-api/post/compose
  2 threads and 1000 connections
  Thread calibration: mean lat.: 4904.885ms, rate sampling interval: 16474ms
  Thread calibration: mean lat.: 4922.708ms, rate sampling interval: 16343ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.16m     4.42m   19.56m    62.47%
    Req/Sec    10.26      9.48    23.00     90.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.02m 
 75.000%   10.53m 
 90.000%   12.77m 
 99.000%   19.56m 
 99.900%   24.90m 
 99.990%   26.60m 
 99.999%   27.12m 
100.000%   27.12m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5783.551     0.000000            1         1.00
   81854.463     0.100000         3771         1.11
  164364.287     0.200000         7542         1.25
  249036.799     0.300000        11310         1.43
  333971.455     0.400000        15081         1.67
  421265.407     0.500000        18854         2.00
  465305.599     0.550000        20741         2.22
  508297.215     0.600000        22624         2.50
  548929.535     0.650000        24505         2.86
  590872.575     0.700000        26406         3.33
  631767.039     0.750000        28273         4.00
  652738.559     0.775000        29217         4.44
  672661.503     0.800000        30157         5.00
  695205.887     0.825000        31107         5.71
  718274.559     0.850000        32061         6.67
  740818.943     0.875000        32993         8.00
  752877.567     0.887500        33454         8.89
  765984.767     0.900000        33945        10.00
  778567.679     0.912500        34412        11.43
  791150.591     0.925000        34877        13.33
  806354.943     0.937500        35341        16.00
  814219.263     0.943750        35577        17.78
  824180.735     0.950000        35810        20.00
  835190.783     0.956250        36045        22.86
  848297.983     0.962500        36290        26.67
  863502.335     0.968750        36521        32.00
  872415.231     0.971875        36635        35.56
  883949.567     0.975000        36752        40.00
  900726.783     0.978125        36870        45.71
  926941.183     0.981250        36987        53.33
 1005060.095     0.984375        37105        64.00
 1054867.455     0.985938        37163        71.11
 1106247.679     0.987500        37222        80.00
 1149239.295     0.989062        37284        91.43
 1194328.063     0.990625        37340       106.67
 1232076.799     0.992188        37399       128.00
 1259339.775     0.992969        37429       142.22
 1284505.599     0.993750        37459       160.00
 1307574.271     0.994531        37487       182.86
 1346371.583     0.995313        37517       213.33
 1377828.863     0.996094        37546       256.00
 1395654.655     0.996484        37561       284.44
 1413480.447     0.996875        37577       320.00
 1423966.207     0.997266        37590       365.71
 1442840.575     0.997656        37606       426.67
 1461714.943     0.998047        37620       512.00
 1471152.127     0.998242        37628       568.89
 1478492.159     0.998437        37638       640.00
 1481637.887     0.998633        37642       731.43
 1488977.919     0.998828        37649       853.33
 1500512.255     0.999023        37657      1024.00
 1502609.407     0.999121        37660      1137.78
 1505755.135     0.999219        37665      1280.00
 1515192.319     0.999316        37669      1462.86
 1517289.471     0.999414        37671      1706.67
 1524629.503     0.999512        37675      2048.00
 1526726.655     0.999561        37677      2275.56
 1534066.687     0.999609        37679      2560.00
 1535115.263     0.999658        37681      2925.71
 1536163.839     0.999707        37683      3413.33
 1552941.055     0.999756        37684      4096.00
 1563426.815     0.999780        37685      4551.11
 1571815.423     0.999805        37686      5120.00
 1573912.575     0.999829        37687      5851.43
 1584398.335     0.999854        37688      6826.67
 1595932.671     0.999878        37689      8192.00
 1595932.671     0.999890        37689      9102.22
 1596981.247     0.999902        37690     10240.00
 1596981.247     0.999915        37690     11702.86
 1607467.007     0.999927        37691     13653.33
 1607467.007     0.999939        37691     16384.00
 1607467.007     0.999945        37691     18204.44
 1608515.583     0.999951        37692     20480.00
 1608515.583     0.999957        37692     23405.71
 1608515.583     0.999963        37692     27306.67
 1608515.583     0.999969        37692     32768.00
 1608515.583     0.999973        37692     36408.89
 1627389.951     0.999976        37693     40960.00
 1627389.951     1.000000        37693          inf
#[Mean    =   429424.853, StdDeviation   =   265044.823]
#[Max     =  1626341.376, Total count    =        37693]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  38200 requests in 30.03m, 7.16MB read
  Socket errors: connect 0, read 5272, write 1383100, timeout 180438
  Non-2xx or 3xx responses: 137
Requests/sec:     21.20
Transfer/sec:      4.07KB